Revit 2024 API
MacroModule.Description Property
 The module description.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public string Description { get; set; }
Visual Basic
Public Property Description As String
	Get
	Set
Visual C++
public:
property String^ Description {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: Cannot modify the Module description due to no permission.
See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace